#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/pocitace/tfc-demo/runs/run-pru6tb4BiRH2AMCS

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.fantaghiro will be created
  + resource "cloudflare_record" "fantaghiro" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fantaghiro"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive)
    }

  # cloudflare_record.workers["phobos"] will be created
  + resource "cloudflare_record" "workers" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "phobos"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive)
    }

  # hcloud_server.fantaghiro will be created
  + resource "hcloud_server" "fantaghiro" {
      + backup_window      = (known after apply)
      + backups            = false
      + datacenter         = (known after apply)
      + delete_protection  = false
      + firewall_ids       = (known after apply)
      + id                 = (known after apply)
      + image              = "ubuntu-20.04"
      + ipv4_address       = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_network       = (known after apply)
      + keep_disk          = false
      + location           = "nbg1"
      + name               = "fantaghiro"
      + rebuild_protection = false
      + server_type        = "cx11"
      + ssh_keys           = [
          + "mb",
        ]
      + status             = (known after apply)
      + user_data          = "oeJeaTg5fOnNZ+G1CcpFgaaMbOI="
    }

  # hcloud_server.workers["phobos"] will be created
  + resource "hcloud_server" "workers" {
      + backup_window      = (known after apply)
      + backups            = false
      + datacenter         = (known after apply)
      + delete_protection  = false
      + firewall_ids       = (known after apply)
      + id                 = (known after apply)
      + image              = "ubuntu-20.04"
      + ipv4_address       = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_network       = (known after apply)
      + keep_disk          = false
      + location           = "nbg1"
      + name               = "phobos"
      + rebuild_protection = false
      + server_type        = "cx11"
      + ssh_keys           = [
          + "mb",
        ]
      + status             = (known after apply)
      + user_data          = "oeJeaTg5fOnNZ+G1CcpFgaaMbOI="
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @mtmn, Action: `pull_request`*